Revit 2024 API
FailuresAccessor.PostFailure Method
 Posts an additional failure message to be processed for the current transaction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public void PostFailure(
	FailureMessage failure
)
Visual Basic
Public Sub PostFailure ( _
	failure As FailureMessage _
)
Visual C++
public:
void PostFailure(
	FailureMessage^ failure
)
Parameters
failure
Type: Autodesk.Revit.DB.FailureMessage
 Failure message to post.
Remarks
 Should be used during failures processing instead of a similar method in a document class. Using method of the document class with the same name during failures processing is prohibited.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  This FailuresAccessor is inactive (is used outside of failures processing).
See Also
FailuresAccessor Class
Autodesk.Revit.DB Namespace